trunk/biblestudygroupatlas/biblestudygroupatlas/biblestudywar/src/main/setup/exampleSoapRequest.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://www.crosswaybibles.org/soap/">
   <soapenv:Header/>
   <soapenv:Body>
      <soap:doPassageQuery soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <key xsi:type="xsd:string">IP</key>
         <passage xsi:type="xsd:string">Mark 5</passage>
         <options xsi:type="soap:outputOptions">
            <!--You may enter the following 47 items in any order-->
            <output-format xsi:type="xsd:string">crossway-xml-1.0</output-format>
            <include-passage-references xsi:type="xsd:boolean">true</include-passage-references>
            <include-first-verse-numbers xsi:type="xsd:boolean">false</include-first-verse-numbers>
            <include-verse-numbers xsi:type="xsd:boolean">true</include-verse-numbers>
            <include-footnotes xsi:type="xsd:boolean">false</include-footnotes>
            <include-footnote-links xsi:type="xsd:boolean">true</include-footnote-links>
            <include-headings xsi:type="xsd:boolean">true</include-headings>
            <include-subheadings xsi:type="xsd:boolean">false</include-subheadings>
            <include-surrounding-chapters xsi:type="xsd:boolean">true</include-surrounding-chapters>
            <include-short-copyright xsi:type="xsd:boolean">false</include-short-copyright>
           
            <include-xml-declaration xsi:type="xsd:boolean">true</include-xml-declaration>
            <include-doctype xsi:type="xsd:boolean">false</include-doctype>
            <include-quote-entities xsi:type="xsd:boolean">true</include-quote-entities>
            <include-simple-entities xsi:type="xsd:boolean">true</include-simple-entities>
            <include-cross-references xsi:type="xsd:boolean">true</include-cross-references>
            <include-line-breaks xsi:type="xsd:boolean">true</include-line-breaks>
            <include-virtual-attributes xsi:type="xsd:boolean">false</include-virtual-attributes>
            <base-element xsi:type="xsd:string">verse-unit</base-element>
            <include-passage-horizontal-lines xsi:type="xsd:boolean">false</include-passage-horizontal-lines>
            <include-heading-horizontal-lines xsi:type="xsd:boolean">false</include-heading-horizontal-lines>
            <include-selahs xsi:type="xsd:boolean">false</include-selahs>
            <include-word-ids xsi:type="xsd:boolean">false</include-word-ids>
            <include-content-type xsi:type="xsd:boolean">true</include-content-type>
            <line-length xsi:type="xsd:integer">100</line-length>
           
         </options>
      </soap:doPassageQuery>
   </soapenv:Body>
</soapenv:Envelope>